app/views/branches/index.html.erb

      <ul>
        <% branch.apps.each do |app| %>
---
SELECT "apps".* FROM "apps" WHERE "apps"."branch_id" = 1