app/views/components/index.html.erb

      <ul>
        <% component.apps.each do |app| %>
---
SELECT "apps".* FROM "apps" WHERE "apps"."component_id" = 1