app/views/landscapes/_form.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."landscape_id" = 6
---
      <ul>
        <% @data[:landscape].accounts.each do |account| %>

SELECT "domains".* FROM "domains"
---
      <br/>
      <%= f.select 'domain_id', @data[:domains], {:include_blank => 'Please select domain'} %>