app/views/landscapes/index.html.erb

SELECT "apps".* FROM "apps" WHERE "apps"."landscape_id" = 6
---
          <ul>
            <% landscape.apps.each do |app| %>

SELECT "accounts".* FROM "accounts" WHERE "accounts"."landscape_id" = 6 LIMIT 1
---
          <ul>
            <% landscape.accounts.each do |account| %>