app/views/apps/_form.html.erb

SELECT "landscapes".* FROM "landscapes"
---
      <br />
      <%= f.select 'landscape_id', @data[:landscapes], {:include_blank => 'Please select landscape'} %>

SELECT "branches".* FROM "branches"
---
      <br />
      <%= f.select 'branch_id', @data[:branches], {:include_blank => 'Please select branch'} %>

SELECT "components".* FROM "components"
---
      <br />
      <%= f.select 'component_id', @data[:components], {:include_blank => 'Please select component'} %>

SELECT "users".* FROM "users"
---
      <br />
      <%= f.select 'user_id', @data[:users], {:include_blank => 'Please select user'} %>