app/controllers/accounts_controller.rb

  def new
    @data = {
        account: Account.new,
        landscapes: Landscape.all.collect { |p| [p.name, p.id] }
---
SELECT "landscapes".* FROM "landscapes"

  def edit
    @data = {
        account: Account.find(params[:id]),
        landscapes: Landscape.all.collect { |p| [p.name, p.id] }
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."account_id" = 1 LIMIT 1

  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("created_at", "landscape_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 10 Apr 2013 13:42:17 UTC +00:00], ["landscape_id", 7], ["name", "test"], ["updated_at", Wed, 10 Apr 2013 13:42:17 UTC +00:00]]

  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "accounts" SET "landscape_id" = 6, "updated_at" = '2013-04-10 13:41:27.654355' WHERE "accounts"."id" = 1