app/controllers/apps_controller.rb

  def index
    @apps = App.all
---
SELECT "apps".* FROM "apps"

  def show
    @app = App.find(params[:id])
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @data = {
        app: App.new,
        landscapes: Landscape.all.collect { |p| [p.name, p.id] },
        branches: Branch.all.collect { |p| [p.name, p.id] },
        scripts: ExternalScript.all.collect { |p| [p.script, p.id] },
        components: Component.all.collect { |p| [p.name, p.id] },
        users: User.all.collect { |p| [p.name, p.id] }
---
SELECT "branches".* FROM "branches"
SELECT "components".* FROM "components"
SELECT "external_scripts".* FROM "external_scripts"
SELECT "landscapes".* FROM "landscapes"

  def edit
    @data = {
        app: App.find(params[:id]),
        landscapes: Landscape.all.collect { |p| [p.name, p.id] },
        branches: Branch.all.collect { |p| [p.name, p.id] },
        scripts: ExternalScript.all.collect { |p| [p.script, p.id] },
        components: Component.all.collect { |p| [p.name, p.id] },
        users: User.all.collect { |p| [p.name, p.id] }
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "branches".* FROM "branches" WHERE "branches"."id" = 8 LIMIT 1
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."id" = 6 LIMIT 1

  def run_command
    @app = App.find(params[:id])
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "10"]]

  def create
    @app = App.new(params[:app])
    respond_to do |format|
      if @app.save
---
INSERT INTO "apps" ("created_at", "name", "path", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 04 Feb 2013 12:42:11 UTC +00:00], ["name", "test"], ["path", ""], ["state", false], ["updated_at", Mon, 04 Feb 2013 12:42:11 UTC +00:00]]

  def update
    @app = App.find(params[:id])

    respond_to do |format|
      if @app.update_attributes(params[:app])
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "apps" SET "external_script_id" = 1, "updated_at" = '2013-02-28 09:48:03.115014' WHERE "apps"."id" = 10

  def destroy
    @app = App.find(params[:id])
    @app.destroy
---
SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "apps" WHERE "apps"."id" = ?  [["id", 1]]