app/controllers/apps_controller.rb

  def edit
    @landscapes = Landscape.all.collect { |p| [p.name, p.id] }
    @branches = Branch.all.collect { |p| [p.name, p.id] }
---
SELECT "landscapes".* FROM "landscapes"
SELECT "branches".* FROM "branches"