app/controllers/build_results_controller.rb

  def index
    @build_results = BuildResult.all
---
SELECT "build_results".* FROM "build_results"

  def show
    @build_result = BuildResult.find(params[:id])
---
SELECT "build_results".* FROM "build_results" WHERE "build_results"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @build_result = BuildResult.new(params[:build_result])

    respond_to do |format|
      if @build_result.save
---
INSERT INTO "build_results" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 09 Apr 2013 15:14:57 UTC +00:00], ["name", "\\\\\\\\iltlvp01.tlv.sap.corp\\\\"], ["updated_at", Tue, 09 Apr 2013 15:14:57 UTC +00:00]]