app/controllers/deployments_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
---
  def generate_command
    logger.info ">>>>>>>>>> #{@data.inspect}"
    app = App.find(params[:id])
    branch = Branch.find(params[:app][:branch_id])
    landscape = app.landscape
    account = Account.find(params[:app][:account_id])