app/controllers/deployments_controller.rb

SELECT "apps".* FROM "apps" WHERE "apps"."landscape_id" = 6
SELECT "branches".* FROM "branches"
SELECT "build_results".* FROM "build_results"
SELECT "components".* FROM "components"
---
  def index
    @data = {
        apps: App.all.collect { |p| [p.name, p.id] },
        app: App.first,
        landscapes: Landscape.all.collect { |p| [p.name, p.id] },
        branches: Branch.all.collect { |p| [p.name, p.id] },
        users: User.all,
        components: Component.all,
        properties_paths: PropertiesPath.all,
        build_results: BuildResult.all

SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "branches".* FROM "branches" WHERE "branches"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "components".* FROM "components" WHERE "components"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "properties_paths".* FROM "properties_paths" WHERE "properties_paths"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "build_results".* FROM "build_results" WHERE "build_results"."id" = ? LIMIT 1  [["id", "1"]]
---
  def generate_command
    logger.info ">>>>>>>>>> #{params.inspect}"
    app = App.find(params[:id])
    branch = Branch.find(params[:app][:branch_id])
    landscape = app.landscape
    user = User.find(params[:user_id])
    component = Component.find(params[:component_id])
    properties_path = PropertiesPath.find(params[:properties_path_id])
    build_result = BuildResult.find(params[:build_results_id])