app/controllers/external_scripts_controller.rb

  def index
    @external_scripts = ExternalScript.all
---
SELECT "external_scripts".* FROM "external_scripts"

  def show
    @external_script = ExternalScript.find(params[:id])
---
SELECT "external_scripts".* FROM "external_scripts" WHERE "external_scripts"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @external_script = ExternalScript.find(params[:id])
---
SELECT "external_scripts".* FROM "external_scripts" WHERE "external_scripts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @external_script = ExternalScript.new(params[:external_script])

    respond_to do |format|
      if @external_script.save
---
INSERT INTO "external_scripts" ("created_at", "script", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 05 Feb 2013 12:04:18 UTC +00:00], ["script", "ls"], ["updated_at", Tue, 05 Feb 2013 12:04:18 UTC +00:00]]

  def destroy
    @external_script = ExternalScript.find(params[:id])
    @external_script.destroy
---
SELECT "external_scripts".* FROM "external_scripts" WHERE "external_scripts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "external_scripts" WHERE "external_scripts"."id" = ?  [["id", 3]]