app/controllers/landscapes_controller.rb

  def index
    @landscapes = Landscape.all
---
SELECT "landscapes".* FROM "landscapes"

  def show
    @landscape = Landscape.find(params[:id])
---
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @data = {
        landscape: Landscape.find(params[:id]),
        accounts: Account.all.collect { |p| [p.name, p.id] },
        domains: Domain.all.collect { |p| [p.name, p.id] }
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."landscape_id" = 6
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @landscape = Landscape.new(params[:landscape])

    respond_to do |format|
      if @landscape.save
---
INSERT INTO "landscapes" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 04 Feb 2013 11:58:05 UTC +00:00], ["name", "test"], ["updated_at", Mon, 04 Feb 2013 11:58:05 UTC +00:00]]

  def update
    @landscape = Landscape.find(params[:id])

    respond_to do |format|
      if @landscape.update_attributes(params[:landscape])
---
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "landscapes" SET "account_id" = 1, "updated_at" = '2013-04-09 13:13:36.560256' WHERE "landscapes"."id" = 6

  def destroy
    @landscape = Landscape.find(params[:id])
    @landscape.destroy
---
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "landscapes" WHERE "landscapes"."id" = ?  [["id", 2]]