app/controllers/properties_paths_controller.rb

  def index
    @properties_paths = PropertiesPath.all
---
SELECT "properties_paths".* FROM "properties_paths"

  def show
    @properties_path = PropertiesPath.find(params[:id])
---
SELECT "properties_paths".* FROM "properties_paths" WHERE "properties_paths"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @properties_path = PropertiesPath.new(params[:properties_path])

    respond_to do |format|
      if @properties_path.save
---
INSERT INTO "properties_paths" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 09 Apr 2013 15:08:02 UTC +00:00], ["name", "./"], ["updated_at", Tue, 09 Apr 2013 15:08:02 UTC +00:00]]