app/views/deployments/index.html.erb

        <th>Application</th>
        <td><%= f.select 'id', @data[:apps], {:include_blank => 'Please select application'} %></td>
---
SELECT "apps".* FROM "apps" LIMIT 1

        <th>Landscape</th>
        <td><%= f.select 'landscape_id', @data[:landscapes], {:include_blank => 'Please select landscape'} %></td>
---
SELECT "landscapes".* FROM "landscapes" LIMIT 1

        <th>Branch</th>
        <td><%= f.select 'branch_id', @data[:branches], {:include_blank => 'Please select branch'} %></td>
---
SELECT "branches".* FROM "branches"