app/views/accounts/_form.html.erb

      <br/>
      <%= f.select 'landscape_id', @data[:landscapes], {:include_blank => 'Please select landscape'} %>
---
SELECT "landscapes".* FROM "landscapes" WHERE "landscapes"."account_id" = 1 LIMIT 1